bench_result_difflevel/rocksdb.out
Set seed to 1695628955296393 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    20971520
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    20800.0 MB (estimated)
FileSize:   10560.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/home/eros/workspace-lsm/rocksdb/test/]
fillrandom   :      10.880 micros/op 91915 ops/sec 228.160 seconds 20971520 operations;   91.2 MB/s
DB path: [/home/eros/workspace-lsm/rocksdb/test/]
readrandom   :       6.375 micros/op 156864 ops/sec 133.692 seconds 20971520 operations;   98.4 MB/s (13258608 of 20971520 found)



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      0/0    0.00 KB   0.0      0.0     0.0      0.0      11.9     11.9       0.0   1.0      0.0    181.5     67.30             26.01       336    0.200       0      0       0.0       0.0
  L1      4/0   251.10 MB   1.0     30.4    11.9     18.5      29.1     10.6       0.0   2.4    203.7    194.8    152.79             92.26        21    7.276     53M  2305K       0.0       0.0
  L2     46/0    2.50 GB   1.0     22.1     9.0     13.1      19.3      6.2       1.4   2.1    208.8    182.3    108.51             59.80       131    0.828     38M  4852K       0.0       0.0
  L3     92/0    5.04 GB   0.2      0.0     0.0      0.0       0.0      0.0       5.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum    142/0    7.78 GB   0.0     52.5    20.9     31.6      60.3     28.7       6.4   5.1    163.7    187.9    328.60            178.07       488    0.673     92M  7158K       0.0       0.0
 Int      0/0    0.00 KB   0.0     52.4    20.8     31.6      59.7     28.1       6.4   5.2    164.8    187.9    325.44            176.66       474    0.687     91M  7157K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     52.5    20.9     31.6      48.4     16.8       0.0   0.0    205.8    189.6    261.30            152.06       152    1.719     92M  7158K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      11.9     11.9       0.0   0.0      0.0    181.5     67.30             26.01       336    0.200       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 361.9 total, 358.9 interval
Flush(GB): cumulative 11.928, interval 11.466
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 60.30 GB write, 170.64 MB/s write, 52.52 GB read, 148.61 MB/s read, 328.6 seconds
Interval compaction: 59.70 GB write, 170.36 MB/s write, 52.38 GB read, 149.46 MB/s read, 325.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 34, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 112, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 123, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 112, total-stops: 123
interval: 231 total count
Block cache LRUCache@0x55cad8258020#91787 capacity: 32.00 MB seed: 1636639369 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 8.9e-05 secs_since: 361
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 361.9 total, 358.9 interval
Cumulative writes: 20M writes, 20M keys, 20M commit groups, 1.0 writes per commit group, ingest: 20.62 GB, 58.36 MB/s
Cumulative WAL: 20M writes, 0 syncs, 20971520.00 writes per sync, written: 20.62 GB, 58.36 MB/s
Cumulative stall: 00:02:34.099 H:M:S, 42.6 percent
Interval writes: 20M writes, 20M keys, 20M commit groups, 1.0 writes per commit group, ingest: 20243.77 MB, 56.41 MB/s
Interval WAL: 20M writes, 0 syncs, 20101450.00 writes per sync, written: 19.77 GB, 56.41 MB/s
Interval stall: 00:02:33.930 H:M:S, 42.9 percent
Write Stall (count): write-buffer-manager-limit-stops: 0