bench_result_difflevel/thanos_stall.out
Default db path: /mnt/pmemdir/1000/dbbench
Attempting to open NVM pool
NVM pool opened successfully
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    20971520
RawSize:    20800.0 MB (estimated)
FileSize:   10560.0 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 9.79387 GB
Default db path: /mnt/pmemdir/1000/dbbench
Attempting to open NVM pool
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    20971520
RawSize:    20800.0 MB (estimated)
FileSize:   10560.0 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 4.17216 GB
fillrandom   :       3.693 micros/op;  268.6 MB/s 77.44 s
wait for background Compaction
memtable stall time: 14.0202 s
L0 stall time: 0  s
L0 slow stall time: 0  s

write in SSD size (MB):8460.33

write in SSD size (MB):1127.04

write in SSD size (MB):0

write in SSD size (MB):0

           Compactions
Level  Files Size(MB) 
---------------------
  0        4      256
  1        2      256
  2        3      768
  3        4     2048

done~~